<!DOCTYPE HTML PUBLIC "-//W3C//DTD HTML 4.0 Transitional//EN">

<!--Converted with LaTeX2HTML 2002-2-1 (1.71)
original version by:  Nikos Drakos, CBLU, University of Leeds
* revised and updated by:  Marcus Hennecke, Ross Moore, Herb Swan
* with significant contributions from:
  Jens Lippmann, Marek Rouchal, Martin Wilck and others -->
<HTML>
<HEAD>
<TITLE>Projektverlauf by Jan</TITLE>
<META NAME="description" CONTENT="Projektverlauf by Jan">
<META NAME="keywords" CONTENT="teamfound">
<META NAME="resource-type" CONTENT="document">
<META NAME="distribution" CONTENT="global">

<META HTTP-EQUIV="Content-Type" CONTENT="text/html; charset=iso-8859-1">
<META NAME="Generator" CONTENT="LaTeX2HTML v2002-2-1">
<META HTTP-EQUIV="Content-Style-Type" CONTENT="text/css">

<LINK REL="STYLESHEET" HREF="teamfound.css">

<LINK REL="next" HREF="node21.html">
<LINK REL="previous" HREF="node18.html">
<LINK REL="up" HREF="node17.html">
<LINK REL="next" HREF="node21.html">
</HEAD>

<BODY >

<DIV CLASS="navigation"><!--Navigation Panel-->
<A NAME="tex2html311"
  HREF="node21.html">
<IMG WIDTH="37" HEIGHT="24" ALIGN="BOTTOM" BORDER="0" ALT="next"
 SRC="/usr/share/latex2html/icons/next.png"></A> 
<A NAME="tex2html307"
  HREF="node17.html">
<IMG WIDTH="26" HEIGHT="24" ALIGN="BOTTOM" BORDER="0" ALT="up"
 SRC="/usr/share/latex2html/icons/up.png"></A> 
<A NAME="tex2html301"
  HREF="node19.html">
<IMG WIDTH="63" HEIGHT="24" ALIGN="BOTTOM" BORDER="0" ALT="previous"
 SRC="/usr/share/latex2html/icons/prev.png"></A> 
<A NAME="tex2html309"
  HREF="node1.html">
<IMG WIDTH="65" HEIGHT="24" ALIGN="BOTTOM" BORDER="0" ALT="contents"
 SRC="/usr/share/latex2html/icons/contents.png"></A>  
<BR>
<B> N&auml;chste Seite:</B> <A NAME="tex2html312"
  HREF="node21.html">Projektverlauf von Martin</A>
<B> Aufw&auml;rts:</B> <A NAME="tex2html308"
  HREF="node17.html">Projektverlauf</A>
<B> Vorherige Seite:</B> <A NAME="tex2html302"
  HREF="node19.html">Fazit: Probleme wachsender Projekte</A>
 &nbsp; <B>  <A NAME="tex2html310"
  HREF="node1.html">Inhalt</A></B> 
<BR>
<BR></DIV>
<!--End of Navigation Panel-->

<H1><A NAME="SECTION00420000000000000000">
Projektverlauf by Jan</A>
</H1>

<P>
W&#228;hrend des Semesters hat sich eigentlich garnichts zu diesem Projekt getan. Selbst Steffen habe ich irgendwann im Juli 2006 gefragt ob wir uns nicht mal wieder Treffen sollten. Am 23. August 2006 war es dann soweit, und wir haben gemeinsam &#252;ber m&#246;gliche Erweiterungen und neue Features diskutiert. Prinzipiell kam dabei aber nichts rum, was nicht schon lange (seit 15. Mai 2006) im wiki unter Milestone 3 eingetragen war. Die dort genannten Features f&#252;r den Server entsprechen lustigerweise auch genau den jetzt implementierten: 
<PRE>
http://wiki.jonasheese.de/index.php/Milestones

Server 17:05, 15. Mai 2006 Kechel (-&gt;Milestone 3 (SS06) - Planung)

* XSL-Stylesheet anstelle von HTML-Antwort von Server 
  -&gt; es wird immer in XML geantwortet
* Web-Admin-Interface
* Framebasierte Seiten unterstützen
* User-Management
* Zeichensaetze beachten
* Automatisches Updated der eingetragenen Seiten (alle x tage oder so)
</PRE>

<P>
Inwieweit das mit den Zeichens&#228;tzen tats&#228;chlich funktioniert weiss ich pers&#246;nlich nicht, ich habe aber im Source-Code gesehen das Jonas irgendwas mit ''encoding'' und so gemacht hat.

<P>
Nach diesem Treffen passierte wiederum erstmal eine Woche lang garnichts.

<P>
Ich begann dann am 2. September in unserem wiki das Interface f&#252;r Milestone 3 (<TT>http://wiki.jonasheese.de/index.php/Interface_Milestone_3</TT>) zu spezifizieren. Dazu &#252;berlegten Martin und ich welche Funktionen denn f&#252;r die obigen Features ben&#246;tigt w&#252;rden, welche Parameter sinnvoll seien und wie die XML-Antwort aussehen k&#246;nnte. Leider hat Jonas's Server immernoch als Datum den 1. Januar 1970, daher ist die History dieses Dokuments nicht so eindeutig zur&#252;ckzuverfolgen. F&#252;r sehr verl&#228;sslich halte ich aber die Angaben in unserem Logbuch (<TT>http://wiki.jonasheese.de/index.php/Logbuch</TT>). Jedenfalls ist diese <SPAN  CLASS="textit">Spezifikation</SPAN>, ausgedruckt auf DIN A4 Papier, 12 Seiten lang, und wurde im weiteren Projektverlauf von allen Projektseiten wohl am h&#228;ufigsten benutzt und erweitert. Die einzig andere, f&#252;r mich n&#252;tzliche Seite im Wiki, war <TT>Server Milestone 3</TT>, da Martin hier die Datenbank Tabellen incl. der Spaltennamen und Fremdschl&#252;ssel aufgef&#252;hrt hat.

<P>
Am 6. September war wieder ein gemeinsames Treffen, jedoch waren nur Steffen, Andreas und Ich anwesend. Nach etwa zwei Stunden palaber war auch das geschafft. Wir hatten zwar interessante Themen, jedoch nicht wirklich spezifisch &#252;ber das TeamFound Projekt diskutiert. 

<P>
Nach diesen Vorbereitungen war ich eine Woche im Ausland, mit dem Bewusstsein da&#223; nur nach meiner R&#252;ckkehr nur noch eine einzige Woche Zeit verbleiben w&#252;rde um &#252;berhaupt etwas zu implementieren. Dementsprechend vermisste ich auch sehr die nicht vorhandene Aktivit&#228;t auf unserer Mailingliste. Nicht eine einzige Mail bzgl. TeamFound erreichte mich in dieser Zeit.  

<P>
Zum Gl&#252;ck hatte sich doch etwas getan. Jedenfalls hatte Martin viel am DBLayer gearbeitet, und somit die Infrastruktur f&#252;r unsere neuen Features stark vorangebracht. Auch Jonas arbeitete schon am Index und Crawler. Was genau da alles ver&#228;ndert wurde oder werden sollte weiss ich nicht, aber bis jetzt hatte ich auch noch keine einzige Zeile am Sever selber geschrieben und wusste dementsprechend wenig dar&#252;ber.

<P>
Hand in Hand mit Martin begann ich dann am Server zu arbeiten, und ein Feature nach dem anderen zu Implementieren. Da wir Zimmernachbarn sind, war die Kommunikation sehr sehr einfach und produktiv. Ich musste einfach nur <SPAN  CLASS="textit">r&#252;bergehen</SPAN> und sagen <SPAN CLASS="MATH"></SPAN><SPAN  CLASS="textit">Hey, schalt mal deinen Chat-Client an, ich hab da ne Frage.</SPAN><SPAN CLASS="MATH"></SPAN> &#220;ber die folgenden Tage lernte ich so sehr schnell mich im Server-Code zurechtzufinden. Nebenbei erstellte ich noch das Web-Interface und passte die Firefox-Toolbar an das neue Interface an (ca. eine Stunde FF-Toolbar). Das Web-Interface entwickelte sich genauso wie Martin und ich Funktionen im Server fertigstellten, und nutzten dieses auch immer sofort um die neuen Funktionen zu testen. Jonas hatte derweil den neuen Indexer und Crawler fertiggestellt. Nach ein paar Stunden Bugfixing von Martin war diese Komponente auch schon voll funktionsf&#228;hig (Jonas hatte anscheinend Probleme mit seinem Internetzugang, und konnte daher bis jetzt seine &#196;nderungen nicht comitten. Es ergaben sich auch viele Merge-Konflikte durch diese Verz&#246;gerung..).

<P>
Gestern, zwei Tage vor Abgabetermin, hatten wir endlich alle Features, bis auf das L&#246;schen von Kategorien und das automatische Updaten der indizierten Seiten, fertiggestellt, und ich konnte einen &#246;ffentlichen Testserver aufsetzen (<TT>http://teamfound.dyndns.org:8080/tf/tf</TT>). Im Chat kl&#228;rten wir mit Andreas auch die letzten Interface-Fragen f&#252;r seine IE Toolbar implementation. Bis dahin hatte ich null Ahnung ob Andreas &#252;berhaupt an seinem Teil des Projekts arbeitet. Wie sich herausstellte ist seine Toolbar jedoch inzwischen wesentlich weiter als <SPAN  CLASS="textit">meine</SPAN>. Immerhin half ich ihm einen Fehler beim Einloggen zu l&#246;sen, eine Funktion die in der FF-Toolbar noch v&#246;llig fehlt.

<P>
Danach erstellte ich ein neues Release v0.9 der FF-Toolbar auf berlios.de und passte unsere Projekt Web-Seite <TT>http://teamfound.berlios.de</TT> entsprechend an.

<P>
Heute, einen Tag vor Abgabe, h&#246;rte ich soeben von Martin, da&#223; die Update-Funktionalit&#228;t nun auch funktioniert (w&#228;hrend ich selber diesen Text hier schreibe). Es sieht also so aus als w&#252;rde alles <SPAN  CLASS="textit">just in time</SPAN> fertig werden :)
<BR>
<P>
Als Fazit w&#252;rde ich sagen, da&#223; besonders die Interface Spezifikation sehr sehr Hilfreich war, um die zu implementierenden Features genau festzulegen. Auch die v&#246;llig von mir getrennt abgelaufene Entwicklung der Internet Explorer Toolbar wurde sicherlich nur dadurch m&#246;glich.

<P>
Innerhalb des Servers fehlten mir eben diese gemeinsamen Strukturen. Wie ich in der letzten Woche gelernt habe gibt es zwar auch dort viele feste Vereinbarungen, jedoch habe ich erst jetzt, nach einer Woche intensiver Besch&#228;ftigung damit, den groben &#220;berblick dar&#252;ber erhalten. Ich bin sicher da&#223; Martin und Jonas diesen &#220;berblick schon immer hatten, aber ich vermisste eine kurze Beschreibung z.B. im wiki dazu doch sehr. 

<P>
Es f&#228;llt auch auf das keinerlei Coding-Styles vereinbart wurden. Es war mir nicht m&#246;glich Funktionsnamen aufgrund eines festgelegten Schemas zu erraten oder <SPAN  CLASS="textit">schnell</SPAN> zu finden. Meist hab ich einfach Martin gefragt, und er hat mir dann gesagt ob es die Funktion, die xyz tut, schon gibt, oder ob ich diese neu Implementieren muss.

<P>
Zum Schluss noch die Anmerkung, da&#223; unser manuelles Logfile im wiki praktisch nur von mir alleine geupdated wurde. Ich hab zwar Martin immer wieder mal dazu &#252;berreden k&#246;nnen, auch einzutragen was er denn so gemacht hat, aber das Interesse daran war wohl bei niemandem sehr hoch. Mir pers&#246;nlich hat das Log besonders f&#252;r diesen Projektbericht sehr geholfen, aber f&#252;r die eigentliche Projektentwicklung war es nicht notwendig. Dennoch finde ich es selber sehr sch&#246;n den Projektverlauf so zur&#252;ckverfolgen zu k&#246;nnen.
<BR>
<P>
So, jetzt bin ich selber gespannt ob wir heute noch den Server v0.3 released bekommen.
<BR>
<P>
Jan

<P>

<DIV CLASS="navigation"><HR>
<!--Navigation Panel-->
<A NAME="tex2html311"
  HREF="node21.html">
<IMG WIDTH="37" HEIGHT="24" ALIGN="BOTTOM" BORDER="0" ALT="next"
 SRC="/usr/share/latex2html/icons/next.png"></A> 
<A NAME="tex2html307"
  HREF="node17.html">
<IMG WIDTH="26" HEIGHT="24" ALIGN="BOTTOM" BORDER="0" ALT="up"
 SRC="/usr/share/latex2html/icons/up.png"></A> 
<A NAME="tex2html301"
  HREF="node19.html">
<IMG WIDTH="63" HEIGHT="24" ALIGN="BOTTOM" BORDER="0" ALT="previous"
 SRC="/usr/share/latex2html/icons/prev.png"></A> 
<A NAME="tex2html309"
  HREF="node1.html">
<IMG WIDTH="65" HEIGHT="24" ALIGN="BOTTOM" BORDER="0" ALT="contents"
 SRC="/usr/share/latex2html/icons/contents.png"></A>  
<BR>
<B> N&auml;chste Seite:</B> <A NAME="tex2html312"
  HREF="node21.html">Projektverlauf von Martin</A>
<B> Aufw&auml;rts:</B> <A NAME="tex2html308"
  HREF="node17.html">Projektverlauf</A>
<B> Vorherige Seite:</B> <A NAME="tex2html302"
  HREF="node19.html">Fazit: Probleme wachsender Projekte</A>
 &nbsp; <B>  <A NAME="tex2html310"
  HREF="node1.html">Inhalt</A></B> </DIV>
<!--End of Navigation Panel-->
<ADDRESS>
Jan Kechel
2006-09-27
</ADDRESS>
</BODY>
</HTML>
