<!DOCTYPE HTML PUBLIC "-//W3C//DTD HTML 4.0 Transitional//EN">

<!--Converted with LaTeX2HTML 2002-2-1 (1.71)
original version by:  Nikos Drakos, CBLU, University of Leeds
* revised and updated by:  Marcus Hennecke, Ross Moore, Herb Swan
* with significant contributions from:
  Jens Lippmann, Marek Rouchal, Martin Wilck and others -->
<HTML>
<HEAD>
<TITLE>Projektverlauf von Martin</TITLE>
<META NAME="description" CONTENT="Projektverlauf von Martin">
<META NAME="keywords" CONTENT="teamfound">
<META NAME="resource-type" CONTENT="document">
<META NAME="distribution" CONTENT="global">

<META HTTP-EQUIV="Content-Type" CONTENT="text/html; charset=iso-8859-1">
<META NAME="Generator" CONTENT="LaTeX2HTML v2002-2-1">
<META HTTP-EQUIV="Content-Style-Type" CONTENT="text/css">

<LINK REL="STYLESHEET" HREF="teamfound.css">

<LINK REL="next" HREF="node22.html">
<LINK REL="previous" HREF="node20.html">
<LINK REL="up" HREF="node17.html">
<LINK REL="next" HREF="node22.html">
</HEAD>

<BODY >

<DIV CLASS="navigation"><!--Navigation Panel-->
<A NAME="tex2html323"
  HREF="node22.html">
<IMG WIDTH="37" HEIGHT="24" ALIGN="BOTTOM" BORDER="0" ALT="next"
 SRC="/usr/share/latex2html/icons/next.png"></A> 
<A NAME="tex2html319"
  HREF="node17.html">
<IMG WIDTH="26" HEIGHT="24" ALIGN="BOTTOM" BORDER="0" ALT="up"
 SRC="/usr/share/latex2html/icons/up.png"></A> 
<A NAME="tex2html313"
  HREF="node20.html">
<IMG WIDTH="63" HEIGHT="24" ALIGN="BOTTOM" BORDER="0" ALT="previous"
 SRC="/usr/share/latex2html/icons/prev.png"></A> 
<A NAME="tex2html321"
  HREF="node1.html">
<IMG WIDTH="65" HEIGHT="24" ALIGN="BOTTOM" BORDER="0" ALT="contents"
 SRC="/usr/share/latex2html/icons/contents.png"></A>  
<BR>
<B> N&auml;chste Seite:</B> <A NAME="tex2html324"
  HREF="node22.html">Projektverlauf by Andreas</A>
<B> Aufw&auml;rts:</B> <A NAME="tex2html320"
  HREF="node17.html">Projektverlauf</A>
<B> Vorherige Seite:</B> <A NAME="tex2html314"
  HREF="node20.html">Projektverlauf by Jan</A>
 &nbsp; <B>  <A NAME="tex2html322"
  HREF="node1.html">Inhalt</A></B> 
<BR>
<BR></DIV>
<!--End of Navigation Panel-->

<H1><A NAME="SECTION00430000000000000000">
Projektverlauf von Martin</A>
</H1>
Der Start des Projekts war einerseits gut, da wir alle 4 weiter an dem Projekt arbeiten wollten.
Was bedeutet, dass es wohl vorher f&#252;r keinen von uns schlecht gelaufen ist.

<P>
Leider begannen wir auch mit der halboffiziellen &#220;bereinkunft, dass wir w&#228;hrend der Vorlesungszeit alle
keine Zeit auf das Projekt verwenden k&#246;nnen. Andere Universit&#228;re Leistungen und Pr&#252;fungen bzw.
Arbeit oder &#228;hnliches waren dringender. Ich war selbst damit sehr Einverstanden, da ich
auch nicht gewusst h&#228;tte wann ich noch Zeit er&#252;brigen kann.

<P>
Das bringt nat&#252;rlich wenn es dann losgehen soll wieder Einarbeitungszeit mit sich. Hinzu kommt f&#252;r
mich, dass vieles was ich schon am ende des letzten Semester als TODO auf der Liste hatte immer
noch unver&#228;ndert ist. Eher ist die Liste l&#228;nger geworden.

<P>
Trozdem sehe ich den Verlauf des Projekts positiv.
Bei unserem ersten gemeinsamen Treffen haben wir festgelegt welche Erweiterungen wir noch in
Teamfound einbauen wollen. Jan hat ziemlich schnell ein Grundger&#252;st 
f&#252;rs Interface im Wiki angelegt. Die Interfacespezifikation war in diesem wie auch 
im vorigen Semester eines der wichtigsten Hilfsmittel. 
Ich konnte immer gut vergleichen was schon funktioniert
und was noch fehlt. 
Ausserdem sind n&#246;tige &#196;nderungen und Erweiterungen, die einer erarbeitet sofort f&#252;r alle
nachlesbar.
Einen grossteil der n&#246;tigen Request/Response Kommunikation
hatten wir beim ersten Treffen besprochen, allerdings
war die Spezifikation am Anfang noch sehr rudiment&#228;r. Wir hatten erstmal nur die 
Aufrufparameter festgelegt und Jan hatte ein leicht ver&#228;ndertes XML-Grundger&#252;st f&#252;r die
Serverantwort entworfen.

<P>
Deshalb habe ich zu beginn immer gleich f&#252;r jede Funktion, die ich implementiert
habe auch die Spezifikation um die Serverantwort erweitert. 
Das ist sp&#228;ter leider aufgrund von Zeitdruck unter den Tisch gefallen.

<P>
Bis zum letzten Treffen vor Abgabe verlief die Arbeit ziemlich z&#228;h. Danach daf&#252;r wirklich
gut. Alle waren wieder oft im IRC-Channel. Die schnellen Absprachen auf diese Art boten
neben dem Wiki aus meiner Sicht die beste Kommunikationsm&#246;glichkeit  w&#228;hrend der Implementation.
Ich habe gut davon profitiert, weil die andern mir in vielen Belangen doch ein
St&#252;ck voraus sind und helfen konnten.
Die Mailingliste lief da eher schlecht, weil meist einfach keine direkte Antwort da ist und
man schlechter diskutieren kann.

<P>
Um ein Fazit zu ziehen, w&#252;rde ich sagen es ist ausser Startschwierigkeiten gut gelaufen 
und wir haben alles umgesetzt was wir uns vorgenommen hatten. 
Leider sind wir noch kein richtiges OpenSource Projekt, da wir den Abgabedruck brauchen um weiterzukommen anstatt von alleine den Antrieb zu entwickeln unser Projekt voranzutreiben. 

<P>

<DIV CLASS="navigation"><HR>
<!--Navigation Panel-->
<A NAME="tex2html323"
  HREF="node22.html">
<IMG WIDTH="37" HEIGHT="24" ALIGN="BOTTOM" BORDER="0" ALT="next"
 SRC="/usr/share/latex2html/icons/next.png"></A> 
<A NAME="tex2html319"
  HREF="node17.html">
<IMG WIDTH="26" HEIGHT="24" ALIGN="BOTTOM" BORDER="0" ALT="up"
 SRC="/usr/share/latex2html/icons/up.png"></A> 
<A NAME="tex2html313"
  HREF="node20.html">
<IMG WIDTH="63" HEIGHT="24" ALIGN="BOTTOM" BORDER="0" ALT="previous"
 SRC="/usr/share/latex2html/icons/prev.png"></A> 
<A NAME="tex2html321"
  HREF="node1.html">
<IMG WIDTH="65" HEIGHT="24" ALIGN="BOTTOM" BORDER="0" ALT="contents"
 SRC="/usr/share/latex2html/icons/contents.png"></A>  
<BR>
<B> N&auml;chste Seite:</B> <A NAME="tex2html324"
  HREF="node22.html">Projektverlauf by Andreas</A>
<B> Aufw&auml;rts:</B> <A NAME="tex2html320"
  HREF="node17.html">Projektverlauf</A>
<B> Vorherige Seite:</B> <A NAME="tex2html314"
  HREF="node20.html">Projektverlauf by Jan</A>
 &nbsp; <B>  <A NAME="tex2html322"
  HREF="node1.html">Inhalt</A></B> </DIV>
<!--End of Navigation Panel-->
<ADDRESS>
Jan Kechel
2006-09-27
</ADDRESS>
</BODY>
</HTML>
